## Day 17: Creating and Modifying DataFrames

In [2]:
list1 = [[1,  2,  3], [4,  5,  6], [7,  8,  9]]

1. Create a DataFrame from the list above with three columns 
[A, B, C].

In [3]:
import pandas as pd

In [13]:
df = pd.DataFrame(list1, columns=["A", "B", "C"])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

2. Using the pandas .at attribute access the number 9 from 
your DataFrame.

In [15]:
df.at[2, "C"]

np.int64(9)

3. Write another code using the .at attribute to change the 
number 9 to 10.

In [18]:
df.at[2, "C"] = 10
df

   A  B   C
0  1  2   3
1  4  5   6
2  7  8  10

4. Create a DataFrame using the data below:

    names = ["John", "Mary", "Peter"]    
    age = [27, 34, 47]    
    sex = ["male", "female", "female"]
      
    Using the .loc attribute, access the age of John from the  DataFrame.

In [42]:
names = ["John", "Mary", "Peter"]
age = [27, 34, 47]
sex = ["male", "female", "female"]

df = pd.DataFrame({"names" : names, "age": age, "sex":sex})
john_age = df.loc[0, "age"] 
john_age

np.int64(27)

5. Using the .loc attribute change the gender of Peter from 
"female" to "male."

In [43]:
# Chaging Peter's gender using loc
ds = df.loc[2, "sex"] = "male"
df

   names  age     sex
0   John   27    male
1   Mary   34  female
2  Peter   47    male

6. Write code to extract a subset of the DataFrame containing 
only male individuals. Write another code to retrieve the 
name and age of the oldest male from the modified 
DataFrame.

In [44]:
# using query method to filter the DataFrame
male = "male"
males = df.query('sex == @male')
males

   names  age   sex
0   John   27  male
2  Peter   47  male

In [60]:
# Sorting the DataFrame and returning the oldest male
oldest = males.sort_values('age', axis=0, ascending=False).max()

print(f"The oldest person is {oldest["names"]} and he is {oldest["age"]} years old")

The oldest person is Peter and he is 47 years old